XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G1xx_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31G1xx_Series</name>
  <description>ABOV Semiconductor CM0+ Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>

  <releases>
    <release version="2.5.0" date="2021-06-28">
      *  Updated version rule
      *  Updated Keil Pack File Name :  ABOV.A31G1xx_DFP  ==> ABOV.A31G1xx_Series
      *  Fixed WT_CR_WTIFLAG define
      *  Fixed HAL_GPIO_ConfigOutput()
      *  Fixed I2Cn_Mwait():   I2Cx ->ST ==> tmp
    </release>
    <release version="2.4.0" date="2020-11-30">
      *  Fixed Driver:   SCUCG_StopMonClk()  ==> HAL_SCU_ClockMonitoring_Disable()
    </release>
    <release version="2.3.0" date="2020-09-11">
      *  Fixed TIMER2n struct ADR Type:   uint16_t  ==> uint32_t
      *  Fixed TIMER2n struct BDR Type:   uint16_t  ==> uint32_t
      *  Fixed HAL_TIMER2n_GetCaptureData():   uint16_t  ==> uint32_t
      *  Added define: TIMER2n_GetCnt( TIMER2x )
    </release>
    <release version="2.2.0" date="2020-07-27">
      *  Changed @author:   "ABOV M team" ==> "ABOV Application Team"
      *  Fixed HAL_UART_Transmit():   UART1 ==> UARTx
      *  Added the registers for Configuration Option Area Page 0 in svd file
    </release>
    <release version="2.1.0" date="2020-05-29">
      *  Added folder:   Core/CMSIS/Include
      *  Added folder:   SFR
      *  Changed folder structure:   Device ---> Core/Device
      *  Changed folder name:   Documentation --> Doc
      *  Deleted file:   slib.c
      *  Deleted file:   slib.h
      *  Added file:   Drivers/Include/A31G11x_hal_libcfg.h
      *  Added file:   Examples/.../A31G11x_it.*
      *  Added file:   Examples/.../A31G11x_PortInit.c
      *  Added file:   Examples/.../A31G11x_SystemClock.c
      *  Added file:   Examples/.../main_conf.h
      *  Merged file:   A31G11x_SCUCC.* + A31G11x_SCUCG.* ==> A31G11x_SCU.*
      *  Changed file name:   Driver/*.*
      *  Changed file:   Device/
      *  Changed file:   Drivers/
      *  Changed file:   Examples/
      *  Changed A31G11x_hal_usart1n to A31G12x_hal_usart1n style.
    </release>
    <release version="2.0.0" date="2019-09-01">
      Changed Example Name, File Name, Function Name, Peripheral Name, Register Name, Field Name, etc.
      Updated Project Options for MDK-ARM and EWARM.
      Updated DDF file for EWARM Development Environment Configuration.
      Updated Flash Loader for MDK-AMR and EWARM to resolve intermittent flash download fails.
      Added TIMER3n_Capture Example.
      Fixed I2Cn_Init() I2Cn_DeInit()
      Fixed USART1n_DataControlConfig()
    </release>
    <release version="1.0.2" date="2018-07-16">
      -  Added device : A31G313, A31G314, A31G316
    </release>
    <release version="1.0.1" date="2018-06-14">
      -  Added device : A31G123, A31G122, A31G112, A31G111
    </release>
    <release version="1.0.0" date="2016-06-17">
      -  First Release version of ABOV CM0 Device Family Pack.
      -  Added device : AC30M1464, AC30M1364, AC30M1432, AC30M1332
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31G</keyword>
  </keywords>

  <devices>
    <family Dfamily="A31G1xx Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>
        The ABOV A31G series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
      </description>
      <!-- Subfamily : A31G11x *********************************************************-->
      <subFamily DsubFamily="A31G11x">
        <processor Dclock="40000000" />
        <compile header="A31G11x/Core/Device/ABOV/A31G11x/Include/A31G11x.h" />
        <debug svd="A31G11x/SVD/A31G11x.svd" />
        <algorithm name="A31G11x\FlashLoader\KEIL\A31G11x_FLASH.FLM" start="0x00000000" size="0x8000" default="1" />
        <algorithm name="A31G11x\FlashLoader\KEIL\A31G11x_CFG.FLM" start="0x1FFFF200" size="0x600" default="1" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="105" />
        <memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1" />
        <feature type="WDT" n="1" m="40" name="Watchdog Timer" />
        <!-- Device : A31G112 -->
        <device Dname="A31G112">
          <description>Package type 48,32LQFP,44MQFP,32QFN,28TSSOP,24QFN</description>
          <memory id="IROM1" start="0x00000000" size="0x8000" startup="1" default="1" />
        </device>
        <!-- Device : A31G111 -->
        <device Dname="A31G111">
          <description>Package type 32LQFP,32QFN,28TSSOP,24QFN</description>
          <memory id="IROM1" start="0x00000000" size="0x4000" startup="1" default="1" />
        </device>
      </subFamily>
      <!-- Subfamily : A31G12x *********************************************************-->
      <subFamily DsubFamily="A31G12x">
        <processor Dclock="40000000" />
        <compile header="A31G12x/Core/Device/ABOV/A31G12x/Include/A31G12x.h" />
        <debug svd="A31G12x/SVD/A31G12x.svd" />
        <algorithm name="A31G12x\FlashLoader\KEIL\A31G12x_FLASH.FLM" start="0x00000000" size="0x10000" default="1" />
        <algorithm name="A31G12x\FlashLoader\KEIL\A31G12x_CFG.FLM" start="0x1FFFF200" size="0x600" default="1" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="105" />
        <memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1" />
        <feature type="WDT" n="1" m="40" name="Watchdog Timer" />
        <!-- Device : A31G123 -->
        <device Dname="A31G123">
          <description>Package type 80,64,48LQFP,44MQFP</description>
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
        <!-- Device : A31G122 -->
        <device Dname="A31G122">
          <description>Package type 80,64LQFP</description>
          <memory id="IROM1" start="0x00000000" size="0x8000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- condition : A31G11x *********************************************************-->
    <condition id="A31G11x CMSIS">
      <description>A31G11x device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G112" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G111" />
    </condition>
    <!-- condition : A31G12x *********************************************************-->
    <condition id="A31G12x CMSIS">
      <description>A31G12x device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G123" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G122" />
    </condition>
