XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G1xx_Series.pdsc
  </conditions>

  <components>
    <!-- component : A31G11x *********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>System Startup for ABOV A31G11x devices</description>
      <files>
        <file category="include" name="A31G11x/Core/Device/ABOV/A31G11x/Include/" />
        <file category="include" name="A31G11x/Drivers/Include/" />
        <file category="header" version="1.0.0" name="A31G11x/Core/Device/ABOV/A31G11x/Include/A31G11x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31G11x/Core/Device/ABOV/A31G11x/Include/system_A31G11x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31G11x/Core/Device/ABOV/A31G11x/Source/ARM/startup_A31G11x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31G11x/Core/Device/ABOV/A31G11x/Source/system_A31G11x.c" attr="config" />
        <file category="source" version="1.0.0" name="A31G11x/Option/KEIL/option_A31G11x.s" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_FrameWork" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x Debug Framework</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_aa_types.h" />
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_libcfg.h" />
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_wtidky.h" />
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_debug_frmwrk.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x ADC Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_adc.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x CRC Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_crc.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FMC" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x FMC Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_fmc.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_fmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2Cn" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x I2Cn Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_i2cn.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_i2cn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="INTC" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x Interrupt Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_intc.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_intc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="LCD" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x LCD Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_lcd.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x PCU Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_pcu.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x PWR Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_pwr.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x SCUCC/SCUCG Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_scu.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCULV" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x SCULV Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_sculv.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_sculv.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER1n" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x TIMER1n Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_timer1n.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_timer1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER2n" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x TIMER2n Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_timer2n.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_timer2n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER3n" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x TIMER3n Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_timer3n.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_timer3n.c" />
      </files>
    </component>
