XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G1xx_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="UARTn" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x UARTn Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_uartn.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_uartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="USART1n" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x USART1n Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_usart1n.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_usart1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x WDT Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_wdt.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WT" Cversion="1.0.0" condition="A31G11x CMSIS">
      <description>A31G11x WT Control</description>
      <files>
        <file category="header" name="A31G11x/Drivers/Include/A31G11x_hal_wt.h" />
        <file category="source" name="A31G11x/Drivers/Source/A31G11x_hal_wt.c" />
      </files>
    </component>
    <!-- component : A31G12x *********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>System Startup for ABOV A31G12x devices</description>
      <files>
        <file category="include" name="A31G12x/Core/Device/ABOV/A31G12x/Include/" />
        <file category="include" name="A31G12x/Drivers/Include/" />
        <file category="header" version="1.0.0" name="A31G12x/Core/Device/ABOV/A31G12x/Include/A31G12x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31G12x/Core/Device/ABOV/A31G12x/Include/system_A31G12x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31G12x/Core/Device/ABOV/A31G12x/Source/ARM/startup_A31G12x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31G12x/Core/Device/ABOV/A31G12x/Source/system_A31G12x.c" attr="config" />
        <file category="source" version="1.0.0" name="A31G12x/Option/KEIL/option_A31G12x.s" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_FrameWork" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x Debug Framework</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_aa_types.h" />
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_libcfg.h" />
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_wtidky.h" />
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_debug_frmwrk.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x ADC Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_adc.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x CRC Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_crc.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FMC" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x FMC Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_fmc.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_fmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2Cn" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x I2Cn Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_i2cn.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_i2cn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="INTC" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x Interrupt Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_intc.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_intc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="LCD" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x LCD Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_lcd.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x PCU Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_pcu.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x PWR Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_pwr.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="A31G12x CMSIS">
      <description>A31G12x SCUCC/SCUCG Control</description>
      <files>
        <file category="header" name="A31G12x/Drivers/Include/A31G12x_hal_scu.h" />
        <file category="source" name="A31G12x/Drivers/Source/A31G12x_hal_scu.c" />
      </files>
    </component>
