XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G1xx_Series.pdsc
    <example name="ABOV USART1n_USRT_Polling" doc="Abstract.txt" folder="A31G11x/Examples/USART1n/USART1n_USRT_Polling">
      <description>USART1n_USRT_Polling Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_USRT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Interrupt" doc="Abstract.txt" folder="A31G11x/Examples/WDT/WDT_Interrupt">
      <description>WDT_Interrupt Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Polling" doc="Abstract.txt" folder="A31G11x/Examples/WDT/WDT_Polling">
      <description>WDT_Polling Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Reset" doc="Abstract.txt" folder="A31G11x/Examples/WDT/WDT_Reset">
      <description>WDT_Reset Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT_Interrupt" doc="Abstract.txt" folder="A31G11x/Examples/WT/WT_Interrupt">
      <description>WT_Interrupt Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT_Polling" doc="Abstract.txt" folder="A31G11x/Examples/WT/WT_Polling">
      <description>WT_Polling Example (A31G112)</description>
      <board name="StarterKit-A31G112CL" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- Example : A31G12x *********************************************************-->
    <example name="ABOV ADC_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/ADC/ADC_Interrupt">
      <description>ADC_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC_Polling" doc="Abstract.txt" folder="A31G12x/Examples/ADC/ADC_Polling">
      <description>ADC_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/ADC_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_Checksum" doc="Abstract.txt" folder="A31G12x/Examples/CRC/CRC_Checksum">
      <description>CRC_Checksum Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_Checksum.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC16" doc="Abstract.txt" folder="A31G12x/Examples/CRC/CRC_CRC16">
      <description>CRC_CRC16 Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC16.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC_CRC16_CCITT" doc="Abstract.txt" folder="A31G12x/Examples/CRC/CRC_CRC16_CCITT">
      <description>CRC_CRC16_CCITT Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/CRC_CRC16_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DEMO_FND_Display" doc="Abstract.txt" folder="A31G12x/Examples/DEMO/DEMO_FND_Display">
      <description>GPIO_DEMO_FND_Display Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DEMO_FND_Display.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DEMO_LED_Display" doc="Abstract.txt" folder="A31G12x/Examples/DEMO/DEMO_LED_Display">
      <description>GPIO_DEMO_LED_Display Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/DEMO_LED_Display.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC_Flash" doc="Abstract.txt" folder="A31G12x/Examples/FMC/FMC_Flash">
      <description>FMC_Flash Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/FMC_Flash.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_EINT" doc="Abstract.txt" folder="A31G12x/Examples/GPIO/GPIO_EINT">
      <description>GPIO_EINT Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_EINT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_Input" doc="Abstract.txt" folder="A31G12x/Examples/GPIO/GPIO_Input">
      <description>GPIO_Input Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO_LedBlinky" doc="Abstract.txt" folder="A31G12x/Examples/GPIO/GPIO_LEDBlinky">
      <description>GPIO_LedBlinky Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/GPIO_LEDBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2Cn_MasterSlave" doc="Abstract.txt" folder="A31G12x/Examples/I2Cn/I2Cn_MasterSlave">
      <description>I2Cn_MasterSlave Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/I2Cn_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LCD_Test" doc="Abstract.txt" folder="A31G12x/Examples/LCD/LCD_Test">
      <description>LCD_Test Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/LCD_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_DeepSleep" doc="Abstract.txt" folder="A31G12x/Examples/PWR/PWR_DeepSleep">
      <description>PWR_DeepSleep Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_DeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_LVI_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/PWR/PWR_LVI_Interrupt">
      <description>PWR_LVI_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_LVI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_LVI_Polling" doc="Abstract.txt" folder="A31G12x/Examples/PWR/PWR_LVI_Polling">
      <description>PWR_LVI_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_LVI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR_Sleep" doc="Abstract.txt" folder="A31G12x/Examples/PWR/PWR_Sleep">
      <description>PWR_Sleep Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n_Capture" doc="Abstract.txt" folder="A31G12x/Examples/TIMER1n/TIMER1n_Capture">
      <description>TIMER1n_Capture Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER1n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n_MatchInterrupt" doc="Abstract.txt" folder="A31G12x/Examples/TIMER1n/TIMER1n_MatchInterrupt">
      <description>TIMER1n_MatchInterrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER1n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n_MatchPolling" doc="Abstract.txt" folder="A31G12x/Examples/TIMER1n/TIMER1n_MatchPolling">
      <description>TIMER1n_MatchPolling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER1n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n_OneShot" doc="Abstract.txt" folder="A31G12x/Examples/TIMER1n/TIMER1n_OneShot">
      <description>TIMER1n_OneShot Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER1n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n_PWM" doc="Abstract.txt" folder="A31G12x/Examples/TIMER1n/TIMER1n_PWM">
      <description>TIMER1n_PWM Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER1n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n_Capture" doc="Abstract.txt" folder="A31G12x/Examples/TIMER2n/TIMER2n_Capture">
      <description>TIMER2n_Capture Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER2n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n_MatchInterrupt" doc="Abstract.txt" folder="A31G12x/Examples/TIMER2n/TIMER2n_MatchInterrupt">
      <description>TIMER2n_MatchInterrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER2n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n_MatchPolling" doc="Abstract.txt" folder="A31G12x/Examples/TIMER2n/TIMER2n_MatchPolling">
      <description>TIMER2n_MatchPolling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER2n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n_OneShot" doc="Abstract.txt" folder="A31G12x/Examples/TIMER2n/TIMER2n_OneShot">
      <description>TIMER2n_OneShot Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER2n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n_PWM" doc="Abstract.txt" folder="A31G12x/Examples/TIMER2n/TIMER2n_PWM">
      <description>TIMER2n_PWM Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER2n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER3n_Capture" doc="Abstract.txt" folder="A31G12x/Examples/TIMER3n/TIMER3n_Capture">
      <description>TIMER3n_Capture Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER3n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER3n_PWM" doc="Abstract.txt" folder="A31G12x/Examples/TIMER3n/TIMER3n_PWM">
      <description>TIMER3n_PWM Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/TIMER3n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UARTn_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/UARTn/UARTn_Interrupt">
      <description>UARTn_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/UARTn_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UARTn_Polling" doc="Abstract.txt" folder="A31G12x/Examples/UARTn/UARTn_Polling">
      <description>UARTn_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/UARTn_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_SPI_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_SPI_Interrupt">
      <description>USART1n_SPI_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_SPI_Polling" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_SPI_Polling">
      <description>USART1n_SPI_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_UART_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_UART_Interrupt">
      <description>USART1n_UART_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_UART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_UART_Polling" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_UART_Polling">
      <description>USART1n_UART_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_UART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_USRT_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_USRT_Interrupt">
      <description>USART1n_USRT_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_USRT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART1n_USRT_Polling" doc="Abstract.txt" folder="A31G12x/Examples/USART1n/USART1n_USRT_Polling">
      <description>USART1n_USRT_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/USART1n_USRT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/WDT/WDT_Interrupt">
      <description>WDT_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Polling" doc="Abstract.txt" folder="A31G12x/Examples/WDT/WDT_Polling">
