XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G1xx_Series.pdsc
      <description>WDT_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT_Reset" doc="Abstract.txt" folder="A31G12x/Examples/WDT/WDT_Reset">
      <description>WDT_Reset Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WDT_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT_Interrupt" doc="Abstract.txt" folder="A31G12x/Examples/WT/WT_Interrupt">
      <description>WT_Interrupt Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT_Polling" doc="Abstract.txt" folder="A31G12x/Examples/WT/WT_Polling">
      <description>WT_Polling Example (A31G123)</description>
      <board name="StarterKit-A31G123ML" vendor="ABOV" />
      <project>
        <environment name="uv" load="KEIL/WT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
